/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[dowolna data]@";
"%@ %[Today]@" = "%1$@ %2$[dzisiaj]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[od wczoraj]@";
"%@ %[This week]@" = "%1$@ %2$[w tym tygodniu]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[w ciągu ostatnich 2 tygodni]@";
"%@ %[This month]@" = "%1$@ %2$[w tym miesiącu]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[w ciągu ostatnich 2 miesięcy]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[dowolny]@";
"%@ %[Yes]@" = "%1$@ %2$[tak]@";
"%@ %[No]@" = "%1$@ %2$[nie]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[zawiera]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[zaczyna się od]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[kończy się na]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[jest]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[dokładnie]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[przed]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[po]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[większa niż]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[mniejsza niż]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[w ciągu ostatnich]@ %3$@ %4$[dni]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[w ciągu ostatnich]@ %3$@ %4$[tygodni]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[w ciągu ostatnich]@ %3$@ %4$[miesięcy]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[w ciągu ostatnich]@ %3$@ %4$[lat]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Przestrzeń kolorów]@ %2$[dowolna przestrzeń kolorów]@";
"%[Color Space]@ %[RGB]@" = "%1$[Przestrzeń kolorów]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Przestrzeń kolorów]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Przestrzeń kolorów]@ %2$[skala szarości]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Zawartość]@ zawiera %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Czas trwania]@ %2$[dłuższy niż]@ %3$@ %4$[min]@ %5$@ %6$[s]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Czas trwania]@ %2$[krótszy niż]@ %3$@ %4$[min]@ %5$@ %6$[s]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Słowa kluczowe]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Słowa kluczowe]@ zawierają %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Rodzaj]@ jest %2$[dowolny]@";
"%[Kind]@ is %[Images]@" = "%1$[Rodzaj]@ to %2$[obrazek]@";
"%[Kind]@ is %[Text]@" = "%1$[Rodzaj]@ to %2$[tekst]@";
"%[Kind]@ is %[PDF]@" = "%1$[Rodzaj]@ to %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Rodzaj]@ to %2$[film]@";
"%[Kind]@ is %[Music]@" = "%1$[Rodzaj]@ to %2$[muzyka]@";
"%[Kind]@ is %[Documents]@" = "%1$[Rodzaj]@ to %2$[dokument]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Rodzaj]@ to %2$[prezentacja]@";
"%[Kind]@ is %[Folders]@" = "%1$[Rodzaj]@ to %2$[katalog]@";
"%[Kind]@ is %[Applications]@" = "%1$[Rodzaj]@ to %2$[program]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Rodzaj]@ jest %2$[inne…]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Etykieta]@ to %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Ostatnio otwarte]@ %2$[dowolna data]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[dowolna data]@";
"%[Created]@ %[Any Date]@" = "%1$[Utworzone]@ %2$[dowolna data]@";
"%[Last Opened]@ %[Today]@" = "%1$[Ostatnio otwarte]@ %2$[dzisiaj]@";
"%[Last Modified]@ %[Today]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[dzisiaj]@";
"%[Created]@ %[Today]@" = "%1$[Utworzone]@ %2$[dzisiaj]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Ostatnio otwarte]@ %2$[od wczoraj]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[od wczoraj]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Utworzone]@ %2$[od wczoraj]@";
"%[Last Opened]@ %[This week]@" = "%1$[Ostatnio otwarte]@ %2$[w tym tygodniu]@";
"%[Last Modified]@ %[This week]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w tym tygodniu]@";
"%[Created]@ %[This week]@" = "%1$[Utworzone]@ %2$[w tym tygodniu]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Ostatnio otwarte]@ %2$[w ciągu ostatnich 2 tygodni]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w ciągu ostatnich 2 tygodni]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Utworzone]@ %2$[w ciągu ostatnich 2 tygodni]@";
"%[Last Opened]@ %[This month]@" = "%1$[Ostatnio otwarte]@ %2$[w tym miesiącu]@";
"%[Last Modified]@ %[This month]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w tym miesiącu]@";
"%[Created]@ %[This month]@" = "%1$[Utworzone]@ %2$[w tym miesiącu]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Ostatnio otwarte]@ %2$[w ciągu ostatnich 2 miesięcy]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w ciągu ostatnich 2 miesięcy]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Utworzone]@ %2$[w ciągu ostatnich 2 miesięcy]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Ostatnio otwarte]@ %2$[dokładnie]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Ostatnio zmodyfikowane]@ %2$[dokładnie]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Utworzone]@ %2$[dokładnie]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Ostatnio otwarte]@ %2$[przed]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Ostatnio zmodyfikowane]@ %2$[przed]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Utworzone]@ %2$[przed]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Ostatnio otwarte]@ %2$[po]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Ostatnio zmodyfikowane]@ %2$[po]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Utworzone]@ %2$[po]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Ostatnio otwarte]@ %2$[w ciągu ostatnich]@ %3$@ %4$[dni]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w ciągu ostatnich]@ %3$@ %4$[dni]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Utworzone]@ %2$[w ciągu ostatnich]@ %3$@ %4$[dni]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Ostatnio otwarte]@ %2$[w ciągu ostatnich]@ %3$@ %4$[tygodni]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w ciągu ostatnich]@ %3$@ %4$[tygodni]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Utworzone]@ %2$[w ciągu ostatnich]@ %3$@ %4$[tygodni]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Ostatnio otwarte]@ %2$[w ciągu ostatnich]@ %3$@ %4$[miesięcy]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w ciągu ostatnich]@ %3$@ %4$[miesięcy]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Utworzone]@ %2$[w ciągu ostatnich]@ %3$@ %4$[miesięcy]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Ostatnio otwarte]@ %2$[w ciągu ostatnich]@ %3$@ %4$[lat]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Ostatnio zmodyfikowane]@ %2$[w ciągu ostatnich]@ %3$@ %4$[lat]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Utworzone]@ %2$[w ciągu ostatnich]@ %3$@ %4$[lat]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Gatunek muzyczny]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Rozszerzenie nazwy]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Nazwa]@ %2$[zawiera]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Nazwa]@ %2$[zaczyna się od]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Nazwa]@ %2$[kończy się na]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Nazwa]@ %2$[jest]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientacja]@ %2$[dowolna orientacja]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientacja]@ %2$[pozioma]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientacja]@ %2$[pionowa]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[inne…]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Proste zapytanie]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Szukaj]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Wielkość]@ %2$[większa niż]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Wielkość]@ %2$[mniejsza niż]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Wielkość]@ %2$[większa niż]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Wielkość]@ %2$[mniejsza niż]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Wielkość]@ %2$[większa niż]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Wielkość]@ %2$[mniejsza niż]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Widoczność]@ %2$[widoczne lub niewidoczne]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Widoczność]@ %2$[rzeczy widoczne]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Widoczność]@ %2$[rzeczy niewidoczne]@";

